app/controllers/posts_controller.rb

  def create
    @post = @user.posts.create! post_params
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @post = @user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", "8a4f2b38-314f-4257-9a7c-7992be5c77a2"], ["id", "28656572-d78d-4507-875f-9b63330bb470"]]

  def destroy
    @post = @user.posts.find(params[:id])
    authorize @post, :destroy?
    @post.destroy!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", "8a4f2b38-314f-4257-9a7c-7992be5c77a2"], ["id", "28656572-d78d-4507-875f-9b63330bb470"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", "28656572-d78d-4507-875f-9b63330bb470"]]

  def edit
    @post = @user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", "8a4f2b38-314f-4257-9a7c-7992be5c77a2"], ["id", "28656572-d78d-4507-875f-9b63330bb470"]]

  def update
    @post = @user.posts.find(params[:id])
    authorize @post, :update?
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", "8a4f2b38-314f-4257-9a7c-7992be5c77a2"], ["id", "28656572-d78d-4507-875f-9b63330bb470"]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3