app/controllers/welcome_controller.rb

  def index
    @user = User.first
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1